app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("content", "status") VALUES (?, ?)  [["content", "db"], ["status", 0]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "content" = ? WHERE "tasks"."id" = ?  [["content", "aa"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)